from datetime import date


INIT_DATE_FOR_SHIFT = {
        "Перша_зміна": date(2026, 1, 2),
        "Друга_зміна": date(2026, 1, 3),
        "Третя_зміна": date(2026, 1, 4),
        "Четверта_зміна": date(2026, 1, 5),
    }
SHIFT_NAMES = tuple(INIT_DATE_FOR_SHIFT.keys())

CYCLE = ("Денна", "Нічна", "Відсипний", "Вихідний")

WEEK_DAYS = ("Пн", "Вт","Ср", "Чт", "Пт", "Сб", "Нд",)
WEEK_LENGTH = len(WEEK_DAYS)

ACTION_BUTTONS = (
    "Обрати дату", "Тиждень", "Місяць",
    )

MONTHS = {
        1: "Січ",
        2: "Лют",
        3: "Бер",
        4: "Кві",
        5: "Тра",
        6: "Чер",
        7: "Лип",
        8: "Сер",
        9: "Вер",
        10: "Жов",
        11: "Лис",
        12: "Гру",
    }